app/Controllers/Barang.php

    public function index()
    {
        $session = session();
        if (!$session->get('logged_in')) {
            return redirect()->to('/login')->with('error', 'Silakan login terlebih dahulu.');
        }
        // if ($session->get('role') !== 'admin') {
        //     return redirect()->to('/dashboard/' . $session->get('role'))->with('error', 'Anda tidak punya akses ke halaman ini.');
        // }
        $barangModel = new BarangModel();
        $ruanganModel = new RuanganModel();
        $barang = $barangModel->select('barang.*, ruangan.nama_ruangan')
            ->join('ruangan', 'ruangan.id = barang.ruangan_id', 'left')
            ->findAll();
        $ruangan = $ruanganModel->findAll();
---
SELECT `barang`.*, `ruangan`.`nama_ruangan`
FROM `barang`
LEFT JOIN `ruangan` ON `ruangan`.`id` = `barang`.`ruangan_id`
SELECT *
FROM `ruangan`

    public function edit($id)
    {
        $session = session();
        if (!$session->get('logged_in')) {
            return redirect()->to('/login')->with('error', 'Silakan login terlebih dahulu.');
        }
        if ($session->get('role') !== 'admin') {
            return redirect()->to('/dashboard/' . $session->get('role'))->with('error', 'Anda tidak punya akses ke halaman ini.');
        }
        $barangModel = new BarangModel();
        $barang = $barangModel->find($id);
---
SELECT *
FROM `barang`
WHERE `barang`.`id` = '2'

        }
        // Insert semua data
        foreach ($dataInsert as $row) {
            $barangModel->insert($row);
---
INSERT INTO `barang` (`nama_barang`, `deskripsi_barang`, `ruangan_id`) VALUES ('KOMPUTER 1', 'CORE I3', '2')