app/Controllers/Profile.php

    public function index()
    {
        $session = session();
        $user_id = $session->get('user_id');
        if (!$user_id) {
            return redirect()->to('/login');
        }
        $userModel = new UserModel();
        $user = $userModel->find($user_id);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '4'