app/Controllers/Ruangan.php

    public function index()
    {
        $model = new RuanganModel();
        $ruangan = $model->findAll();
---
SELECT *
FROM `ruangan`

    public function store()
    {
        $model = new RuanganModel();
        $data = [
            'nama_ruangan' => $this->request->getPost('nama_ruangan'),
        ];
        $model->insert($data);
---
INSERT INTO `ruangan` (`nama_ruangan`) VALUES ('kelas3')

    public function edit($id)
    {
        $model = new RuanganModel();
        $ruangan = $model->find($id);
---
SELECT *
FROM `ruangan`
WHERE `ruangan`.`id` = '1'