app/Controllers/Tiket.php

SELECT `tiket`.*, `ruangan`.`nama_ruangan`, `barang`.`nama_barang`
FROM `tiket`
LEFT JOIN `ruangan` ON `ruangan`.`id` = `tiket`.`ruangan_id`
LEFT JOIN `barang` ON `barang`.`id` = `tiket`.`barang_id`
WHERE `tiket`.`ruangan_id` = '1'
ORDER BY `tiket`.`created_at` DESC
SELECT *
FROM `barang`
SELECT *
FROM `ruangan`
SELECT *
FROM `ruangan`
WHERE `id` = '1'
---
    public function index()
    {
        $session = session();
        if (!$session->get('logged_in')) {
            return redirect()->to('/login')->with('error', 'Silakan login terlebih dahulu.');
        }
        $tiketModel = new TiketModel();
        $ruanganModel = new RuanganModel();
        $barangModel = new BarangModel();
        $role = $session->get('role');
        $user_id = $session->get('user_id');
        $tanggal_mulai = $this->request->getGet('tanggal_mulai');
        $tanggal_akhir = $this->request->getGet('tanggal_akhir');
        $builder = $tiketModel->select('tiket.*, ruangan.nama_ruangan, barang.nama_barang')
            ->join('ruangan', 'ruangan.id = tiket.ruangan_id', 'left')
            ->join('barang', 'barang.id = tiket.barang_id', 'left');
        if ($role === 'admin' || $role === 'it') {
            // Tidak ada filter role
        } else if ($role === 'ruangan') {
            $builder->where('tiket.ruangan_id', $session->get('ruangan_id'));
        }
        if ($tanggal_mulai && $tanggal_akhir) {
            $builder->where('tiket.created_at >=', $tanggal_mulai.' 00:00:00');
            $builder->where('tiket.created_at <=', $tanggal_akhir.' 23:59:59');
        }
        $tiket = $builder->orderBy('tiket.created_at', 'DESC')->findAll();
        if ($role === 'admin' || $role === 'it') {
            $ruangan = $ruanganModel->findAll();
        } else if ($role === 'ruangan') {
            $ruangan_id = $session->get('ruangan_id');
            $ruangan = $ruanganModel->where('id', $ruangan_id)->findAll();
        } else {
            $ruangan = [];
        }
        $barang = $barangModel->findAll();

SELECT COUNT(*) AS `numrows` FROM `tiket`
INSERT INTO `tiket` (`nomor_tiket`, `ruangan_id`, `barang_id`, `deskripsi_kerusakan`, `status`, `hasil_perbaikan`, `created_at`, `foto_kerusakan`) VALUES ('TIK20250707003', '2', '7', 'fdfdf', 'Menunggu', NULL, '2025-07-07 07:30:33', 'img_686b152942cd9.png')
---
    public function store()
    {
        $session = session();
        if (!$session->get('logged_in')) {
            return redirect()->to('/login')->with('error', 'Silakan login terlebih dahulu.');
        }
        $tiketModel = new TiketModel();
        // Generate nomor tiket otomatis
        $nomor_tiket = 'TIK' . date('Ymd') . sprintf('%03d', $tiketModel->countAll() + 1);
        $data = [
            'nomor_tiket' => $nomor_tiket,
            'ruangan_id' => $this->request->getPost('ruangan_id'),
            'barang_id' => $this->request->getPost('barang_id'),
            'deskripsi_kerusakan' => $this->request->getPost('deskripsi_kerusakan'),
            'status' => 'Menunggu',
            'hasil_perbaikan' => null,
            'created_at' => date('Y-m-d H:i:s'),
        ];
        // Handle upload foto kerusakan
        $foto = $this->request->getFile('foto_kerusakan');
        $foto_base64 = $this->request->getPost('foto_kerusakan_camera');
        if ($foto_base64) {
            // Jika upload dari kamera (base64)
            $data['foto_kerusakan'] = $this->saveBase64Image($foto_base64);
        } else if ($foto && $foto->isValid() && !$foto->hasMoved()) {
            $newName = $foto->getRandomName();
            $foto->move('uploads', $newName);
            $data['foto_kerusakan'] = $newName;
        }
        $tiketModel->insert($data);

SELECT *
FROM `barang`
WHERE `ruangan_id` = '3'
---
    public function getBarangByRuangan($ruangan_id)
    {
        $barangModel = new BarangModel();
        $barang = $barangModel->where('ruangan_id', $ruangan_id)->findAll();