app/Controllers/Tiket.php

SELECT `tiket`.*, `ruangan`.`nama_ruangan`, `barang`.`nama_barang`
FROM `tiket`
LEFT JOIN `ruangan` ON `ruangan`.`id` = `tiket`.`ruangan_id`
LEFT JOIN `barang` ON `barang`.`id` = `tiket`.`barang_id`
WHERE `tiket`.`id` = '1'
 LIMIT 1
---
    public function detail($id)
    {
        $session = session();
        if (!$session->get('logged_in')) {
            return redirect()->to('/login')->with('error', 'Silakan login terlebih dahulu.');
        }
        $tiketModel = new TiketModel();
        $ruanganModel = new RuanganModel();
        $barangModel = new BarangModel();
        $tiket = $tiketModel->select('tiket.*, ruangan.nama_ruangan, barang.nama_barang')
            ->join('ruangan', 'ruangan.id = tiket.ruangan_id', 'left')
            ->join('barang', 'barang.id = tiket.barang_id', 'left')
            ->where('tiket.id', $id)
            ->first();