app/Controllers/User.php

SELECT *
FROM `users`
WHERE `role` = 'admin'
SELECT *
FROM `ruangan`
---
    public function index()
    {
        $session = session();
        if (!$session->get('logged_in')) {
            return redirect()->to('/login')->with('error', 'Silakan login terlebih dahulu.');
        }
        // if ($session->get('role') !== 'admin') {
        //     return redirect()->to('/dashboard/' . $session->get('role'))->with('error', 'Anda tidak punya akses ke halaman ini.');
        // }
        $roleFilter = $this->request->getGet('role') ?: 'admin';
        $userModel = new UserModel();
        $users = $userModel->where('role', $roleFilter)->findAll();
        // Ambil data ruangan untuk select
        $ruanganModel = new \App\Models\RuanganModel();
        $ruangan = $ruanganModel->findAll();