app/Models/UserModel.php

SELECT *
FROM `users`
WHERE `username` = 'kelas3'
 LIMIT 1
---
    public function findByUsername($username)
    {
        return $this->where('username', $username)->first();